### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.cdn.azurerm_storage_container.exchange will be updated in-place
  ~ resource "azurerm_storage_container" "exchange" {
        id                                = "https://iopitnwalletcdnst01.blob.core.windows.net/exchange"
        name                              = "exchange"
      + storage_account_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletcdnst01"
      - storage_account_name              = "iopitnwalletcdnst01" -> null
        # (7 unchanged attributes hidden)
    }

  # module.cdn.azurerm_storage_container.hub-spid-login will be updated in-place
  ~ resource "azurerm_storage_container" "hub-spid-login" {
        id                                = "https://iopitnwalletcdnst01.blob.core.windows.net/hub-spid-login"
        name                              = "hub-spid-login"
      + storage_account_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletcdnst01"
      - storage_account_name              = "iopitnwalletcdnst01" -> null
        # (7 unchanged attributes hidden)
    }

  # module.cdn.azurerm_storage_container.pdnd will be updated in-place
  ~ resource "azurerm_storage_container" "pdnd" {
        id                                = "https://iopitnwalletcdnst01.blob.core.windows.net/pdnd"
        name                              = "pdnd"
      + storage_account_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletcdnst01"
      - storage_account_name              = "iopitnwalletcdnst01" -> null
        # (7 unchanged attributes hidden)
    }

  # module.cdn.azurerm_storage_container.well_known will be updated in-place
  ~ resource "azurerm_storage_container" "well_known" {
        id                                = "https://iopitnwalletcdnst01.blob.core.windows.net/well-known"
        name                              = "well-known"
      + storage_account_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletcdnst01"
      - storage_account_name              = "iopitnwalletcdnst01" -> null
        # (7 unchanged attributes hidden)
    }

  # module.function_apps.azurerm_monitor_metric_alert.app_service_plan_cpu_alert will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "app_service_plan_cpu_alert" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Insights/metricAlerts/[io-p-itn-wallet-user-asp-02] High CPU Usage"
        name                     = "[io-p-itn-wallet-user-asp-02] High CPU Usage"
      ~ severity                 = 0 -> 1
        tags                     = {}
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.storage_accounts.azurerm_key_vault_secret.st_uat_connection_string will be updated in-place
  ~ resource "azurerm_key_vault_secret" "st_uat_connection_string" {
        id                      = "https://io-p-itn-wallet-kv-01.vault.azure.net/secrets/StorageUatConnectionString/d44e5051403f4abfa1b9d44bfa62fcf7"
        name                    = "StorageUatConnectionString"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (7 unchanged attributes hidden)
    }

  # module.storage_accounts.azurerm_storage_container.cosmos_01_backup will be updated in-place
  ~ resource "azurerm_storage_container" "cosmos_01_backup" {
        id                                = "https://iopitnwalletst01.blob.core.windows.net/cosmos-01-backup"
        name                              = "cosmos-01-backup"
      + storage_account_id                = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01"
      - storage_account_name              = "iopitnwalletst01" -> null
        # (7 unchanged attributes hidden)
    }

  # module.storage_accounts.module.storage_account.azurerm_monitor_metric_alert.storage_account_health_check[0] will be updated in-place
  ~ resource "azurerm_monitor_metric_alert" "storage_account_health_check" {
        id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Insights/metricAlerts/[iopitnwalletst01] Low Availability"
        name                     = "[iopitnwalletst01] Low Availability"
      ~ tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_storage_account"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.1.1" -> "1.0.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.storage_accounts.module.storage_account.azurerm_private_endpoint.this["blob"] will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-wallet-blob-pep-01"
        name                          = "io-p-itn-wallet-blob-pep-01"
      ~ tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_storage_account"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.1.1" -> "1.0.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.storage_accounts.module.storage_account.azurerm_private_endpoint.this["queue"] will be updated in-place
  ~ resource "azurerm_private_endpoint" "this" {
        id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-wallet-queue-pep-01"
        name                          = "io-p-itn-wallet-queue-pep-01"
      ~ tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_storage_account"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.1.1" -> "1.0.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.storage_accounts.module.storage_account.azurerm_storage_account.this will be updated in-place
  ~ resource "azurerm_storage_account" "this" {
      ~ allow_nested_items_to_be_public    = true -> false
        id                                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletst01"
        name                               = "iopitnwalletst01"
      ~ tags                               = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_storage_account"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.1.1" -> "1.0.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (96 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.storage_accounts.module.storage_account_uat.azurerm_monitor_metric_alert.storage_account_health_check[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "azurerm_monitor_metric_alert" "storage_account_health_check" {
      - auto_mitigate            = false -> null
      - description              = "The average availability is less than 99.8%. Runbook: not needed." -> null
      - enabled                  = true -> null
      - frequency                = "PT5M" -> null
      - id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Insights/metricAlerts/[iouitnwalletst01] Low Availability" -> null
      - name                     = "[iouitnwalletst01] Low Availability" -> null
      - resource_group_name      = "io-p-itn-wallet-rg-01" -> null
      - scopes                   = [
          - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iouitnwalletst01",
        ] -> null
      - severity                 = 0 -> null
      - tags                     = {
          - "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Prod"
          - "ManagementTeam" = "IO Wallet"
          - "ModuleName"     = "azure_storage_account"
          - "ModuleSource"   = "DX"
          - "ModuleVersion"  = "0.1.1"
          - "Owner"          = "IO"
          - "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        } -> null
      - window_size              = "PT5M" -> null
        # (2 unchanged attributes hidden)

      - action {
          - action_group_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Insights/actionGroups/io-p-itn-wallet-ag-01" -> null
          - webhook_properties = {} -> null
        }

      - criteria {
          - aggregation            = "Average" -> null
          - metric_name            = "Availability" -> null
          - metric_namespace       = "Microsoft.Storage/storageAccounts" -> null
          - operator               = "LessThan" -> null
          - skip_metric_validation = false -> null
          - threshold              = 99.8 -> null
        }
    }

  # module.storage_accounts.module.storage_account_uat.azurerm_private_endpoint.this["blob"] must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-u-itn-wallet-blob-pep-01" -> (known after apply)
        name                          = "io-u-itn-wallet-blob-pep-01"
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/networkInterfaces/io-u-itn-wallet-blob-pep-01.nic.e0eb3f02-bd02-4b84-9d45-9676fe9211f2"
              - name = "io-u-itn-wallet-blob-pep-01.nic.e0eb3f02-bd02-4b84-9d45-9676fe9211f2"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-u-itn-wallet-blob-pep-01/privateDnsZoneGroups/private-dns-zone-group/privateDnsZoneConfigs/privatelink.blob.core.windows.net"
              - name                = "privatelink.blob.core.windows.net"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "iouitnwalletst01.privatelink.blob.core.windows.net"
                      - ip_addresses = [
                          - "10.20.2.210",
                        ]
                      - name         = "iouitnwalletst01"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      ~ tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_storage_account"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.1.1" -> "1.0.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (4 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-u-itn-wallet-blob-pep-01/privateDnsZoneGroups/private-dns-zone-group" -> (known after apply)
            name                 = "private-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                              = "io-u-itn-wallet-blob-pep-01"
          ~ private_connection_resource_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iouitnwalletst01" -> (known after apply) # forces replacement
          ~ private_ip_address                = "10.20.2.210" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.storage_accounts.module.storage_account_uat.azurerm_private_endpoint.this["queue"] must be replaced
-/+ resource "azurerm_private_endpoint" "this" {
      ~ custom_dns_configs            = [] -> (known after apply)
      ~ id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-u-itn-wallet-queue-pep-01" -> (known after apply)
        name                          = "io-u-itn-wallet-queue-pep-01"
      ~ network_interface             = [
          - {
              - id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/networkInterfaces/io-u-itn-wallet-queue-pep-01.nic.8a7179f7-4b86-45af-be9b-89c07d98a3f7"
              - name = "io-u-itn-wallet-queue-pep-01.nic.8a7179f7-4b86-45af-be9b-89c07d98a3f7"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-u-itn-wallet-queue-pep-01/privateDnsZoneGroups/private-dns-zone-group/privateDnsZoneConfigs/privatelink.queue.core.windows.net"
              - name                = "privatelink.queue.core.windows.net"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "iouitnwalletst01.privatelink.queue.core.windows.net"
                      - ip_addresses = [
                          - "10.20.2.209",
                        ]
                      - name         = "iouitnwalletst01"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
      ~ tags                          = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_storage_account"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.1.1" -> "1.0.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (4 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-u-itn-wallet-queue-pep-01/privateDnsZoneGroups/private-dns-zone-group" -> (known after apply)
            name                 = "private-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                              = "io-u-itn-wallet-queue-pep-01"
          ~ private_connection_resource_id    = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iouitnwalletst01" -> (known after apply) # forces replacement
          ~ private_ip_address                = "10.20.2.209" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.storage_accounts.module.storage_account_uat.azurerm_storage_account.this must be replaced
-/+ resource "azurerm_storage_account" "this" {
      ~ account_replication_type           = "ZRS" -> "LRS" # forces replacement
      ~ allow_nested_items_to_be_public    = true -> false
      ~ id                                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iouitnwalletst01" -> (known after apply)
      ~ large_file_share_enabled           = false -> (known after apply)
        name                               = "iouitnwalletst01"
      ~ primary_access_key                 = (sensitive value)
      ~ primary_blob_connection_string     = (sensitive value)
      ~ primary_blob_endpoint              = "https://iouitnwalletst01.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                  = "iouitnwalletst01.blob.core.windows.net" -> (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      ~ primary_connection_string          = (sensitive value)
      ~ primary_dfs_endpoint               = "https://iouitnwalletst01.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                   = "iouitnwalletst01.dfs.core.windows.net" -> (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      ~ primary_file_endpoint              = "https://iouitnwalletst01.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                  = "iouitnwalletst01.file.core.windows.net" -> (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      ~ primary_location                   = "italynorth" -> (known after apply)
      ~ primary_queue_endpoint             = "https://iouitnwalletst01.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                 = "iouitnwalletst01.queue.core.windows.net" -> (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      ~ primary_table_endpoint             = "https://iouitnwalletst01.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                 = "iouitnwalletst01.table.core.windows.net" -> (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      ~ primary_web_endpoint               = "https://iouitnwalletst01.z38.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                   = "iouitnwalletst01.z38.web.core.windows.net" -> (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      ~ secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      ~ secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      ~ tags                               = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "ModuleName"     = "azure_storage_account"
            "ModuleSource"   = "DX"
          ~ "ModuleVersion"  = "0.1.1" -> "1.0.1"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (22 unchanged attributes hidden)

      ~ blob_properties {
          - change_feed_retention_in_days = 0 -> null
          + default_service_version       = (known after apply)
            # (3 unchanged attributes hidden)
        }

      ~ identity {
          - identity_ids = [] -> null
          ~ principal_id = "eabf1ce2-246f-46a4-9820-4875ad5a0745" -> (known after apply)
          ~ tenant_id    = "7788edaf-0346-4068-9d79-c868aed15b3d" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ network_rules (known after apply)

      ~ queue_properties (known after apply)
      - queue_properties {
          - hour_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      ~ routing (known after apply)

      ~ share_properties (known after apply)
      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }

      ~ static_website (known after apply)
    }

Plan: 3 to add, 11 to change, 4 to destroy.
```

</details>
